In [2]:
# Import pandas for DataFrame
import pandas as pd

In [3]:
# Identify files
schools_file = "Resources/schools_complete.csv"
students_file = "Resources/students_complete.csv"

In [4]:
# Load schools csv into a DataFrame
schools_df = pd.read_csv(schools_file, encoding="utf8")

schools_df.head()

   School ID            school_name      type  size   budget
0          0      Huang High School  District  2917  1910635
1          1   Figueroa High School  District  2949  1884411
2          2    Shelton High School   Charter  1761  1056600
3          3  Hernandez High School  District  4635  3022020
4          4    Griffin High School   Charter  1468   917500

In [5]:
# Load students csv into a DataFrame
students_df = pd.read_csv(students_file, encoding="utf8")

students_df.head()

,Student ID,student_name,gender,grade,school_name,reading_score,math_score
0,0,Paul Bradley,M,9th,Huang High School,66,79
1,1,Victor Smith,M,12th,Huang High School,94,61
2,2,Kevin Rodriguez,M,12th,Huang High School,90,60
3,3,Dr. Richard Scott,M,12th,Huang High School,67,58
4,4,Bonnie Ray,F,9th,Huang High School,97,84

In [6]:
# Rename columns
renamed_schools_df = schools_df.rename(columns= {"school_name": "School Name",
                                                "type": "Type",
                                                "size": "Size",
                                                "budget": "Budget"})
renamed_schools_df.head()

   School ID            School Name      Type  Size   Budget
0          0      Huang High School  District  2917  1910635
1          1   Figueroa High School  District  2949  1884411
2          2    Shelton High School   Charter  1761  1056600
3          3  Hernandez High School  District  4635  3022020
4          4    Griffin High School   Charter  1468   917500

In [7]:
# Rename columns
renamed_students_df = students_df.rename(columns= {"student_name": "Student Name",
                                                  "gender": "Gender",
                                                  "grade": "Grade",
                                                  "school_name": "School Name",
                                                  "reading_score":"Reading Score",
                                                  "math_score": "Math Score"})
renamed_students_df.head()

,Student ID,Student Name,Gender,Grade,School Name,Reading Score,Math Score
0,0,Paul Bradley,M,9th,Huang High School,66,79
1,1,Victor Smith,M,12th,Huang High School,94,61
2,2,Kevin Rodriguez,M,12th,Huang High School,90,60
3,3,Dr. Richard Scott,M,12th,Huang High School,67,58
4,4,Bonnie Ray,F,9th,Huang High School,97,84

In [19]:
# District: Total Schools
total_schools = renamed_schools_df["School ID"].count()

print(total_schools)

15

In [20]:
# District: Total Students
total_students = renamed_students_df["Student ID"].count()

print(total_students)

39170

In [24]:
# District: Total Budget
total_budget = renamed_schools_df["Budget"].sum()

print(total_budget)

24649428

In [25]:
# District: Average Math Score
avg_math = renamed_students_df["Math Score"].mean()

print(avg_math)

78.98537145774827

In [27]:
# District: Average Reading Score
avg_reading = renamed_students_df["Reading Score"].mean()

print(avg_reading)

81.87784018381414

In [13]:
# Find min and max of math score
renamed_students_df["Math Score"].describe()

count    39170.000000
mean        78.985371
std         12.309968
min         55.000000
25%         69.000000
50%         79.000000
75%         89.000000
max         99.000000
Name: Math Score, dtype: float64

In [14]:
# Find min and max of reading score
renamed_students_df["Reading Score"].describe()

count    39170.00000
mean        81.87784
std         10.23958
min         63.00000
25%         73.00000
50%         82.00000
75%         91.00000
max         99.00000
Name: Reading Score, dtype: float64

In [15]:
# District: % Passing Math
# Passing Score: 70?
if renamed_students_df["Math Score"] >= 70:
    renamed_students_df["Math: Pass/Fail"] = "Pass"
else:
    renamed_students_df["Math: Pass/Fail"] = "Fail"
    
renamed_students_df.head()

ValueError: The truth value of a Series is ambiguous. Use a.empty, a.bool(), a.item(), a.any() or a.all().

In [ ]:
# District: % Passing Reading
# Passing Score: 70?

In [ ]:
# District: % Overall Passing
# Passing Score: 70?